---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.Clear
source: html/1b07da0b-f7cf-95e1-a7b2-585b72177edd.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.Clear Method

Removes every edge array from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```